Load-test-results.txt
k6.exe run k6.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: k6.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop)
              * default: 50 looping VUs for 30s (gracefulStop: 30s)



  █ THRESHOLDS

    http_req_duration
    ✓ 'p(95)<200' p(95)=54.04ms

    http_req_failed
    ✗ 'rate<0.01' rate=9.93%


  █ TOTAL RESULTS

    checks_total.......: 2900   94.82034/s
    checks_succeeded...: 94.68% 2746 out of 2900
    checks_failed......: 5.31%  154 out of 2900

    ✗ status is 200
      ↳  90% — ✓ 1306 / ✗ 144
    ✗ response time < 250ms
      ↳  99% — ✓ 1440 / ✗ 10

    HTTP
    http_req_duration..............: avg=40.31ms min=16.54ms med=36.41ms max=350.01ms p(90)=48.01ms p(95)=54.04ms
      { expected_response:true }...: avg=40.18ms min=23.78ms med=36.51ms max=350.01ms p(90)=47.01ms p(95)=51.58ms
    http_req_failed................: 9.93%  144 out of 1450
    http_reqs......................: 1450   47.41017/s

    EXECUTION
    iteration_duration.............: avg=1.04s   min=1.02s   med=1.03s   max=1.46s    p(90)=1.04s   p(95)=1.05s
    iterations.....................: 1450   47.41017/s
    vus............................: 50     min=50          max=50
    vus_max........................: 50     min=50          max=50

    NETWORK
    data_received..................: 747 kB 24 kB/s
    data_sent......................: 144 kB 4.7 kB/s



running (0m30.6s), 00/50 VUs, 1450 complete and 0 interrupted iterations
default ✓ [======================================] 50 VUs  30s
ERRO[0030] thresholds on metrics 'http_req_failed' have been crossed